Repository: coosoft/mtn-browse
Catalog: locale/*.po
Languages: de

source: Your preferences cannot be loaded: {error_message}
de: Ihre Einstellungen können nicht geladen werden: {error_message}

source: {error_message} This is fatal, I am going to exit.
de: {error_message} Dies ist ein fataler Fehler, das Programm wird beendet.

source: Cannot open database {database_name}.
de: Kann Datenbank {database_name} nicht öffnen.

source: There is a problem connecting to the server, the details are: <b><i>{error_message}</i></b>
de: Es gab ein Problem bei der Verbindung zum Server, die weiteren Einzelheiten sind: <b><i>{error_message}</i></b>

source: Connecting to server `{server}'
de: Verbinde zu Server `{server}'

source: Your preferences could not be saved:
de: Ihre Einstellungen konnten nicht gespeichert werden:

source: Gnome cannot display Monotone Browser's home page. Gnome gave: <b><i>{gnome_error_message}</i></b>
de: Gnome kann die Homepage von Monotone Browser nicht anzeigen. Gnome gab zurück: <b><i>{gnome_error_message}</i></b>

source: A graphical front-end browser for Monotone VCS databases
de: Ein grafischer Browser für Monotone-Datenbanken

source: Populating directory list
de: Erweiterte Verzeichnisliste

source: Cannot generate temporary file name: {error_message}.
de: Kann temporären Dateinamen nicht erzeugen: {error_message}.

source: Unknown file type, not viewing.
de: Unbekannter Dateityp, keine Ansicht.

source: Gnome cannot launch the helper application for MIME type {mime_type}. Gnome gave: <b><i>{gnome_error_message}</i></b>
de: Gnome kann die Hilfsanwendung für den MIME-Typ {mime_type} nicht starten. Gnome gab zurück: <b><i>{gnome_error_message}</i></b>

source: No application is associated with MIME type {mime_type}, using Vi instead.
de: Keine Anwendung mit MIME-Typ {mime_type} assoziiert, nutze stattdessen Vi.

source: Changed file encoding from `{old_encoding}' to `{new_encoding}'
de: Dateikodierung von `{old_encoding}' nach `{new_encoding}' geändert

source: All Encodings
de: Alle Kodierungen

source: Changed authentication key from `{old_key}' to `{new_key}'
de: Authentifizierungsschlüssel von `{old_key}' auf `{new_key}' geändert

source: Unspecified
de: Nicht angegeben

source: No Keys
de: Keine Schlüssel

source: File Name
de: Dateiname

source: Last Update
de: Zuletzt geändert

source: Author
de: Autor

source: open failed: {error_message}
de: Öffnen schlug fehl: {error_message}

source: No Bookmarks
de: Keine Lesezeichen

source: Manage Server Bookmarks
de: Server-Lesezeichen verwalten

source: <Service> ({service_name})
de: <Dienst> ({service_name})

source: <WorkSpace> ({database_name})
de: <Arbeitsbereich> ({database_name})

source: Fetching branch list
de: Hole Liste von Zweigen

source: Populating branch list
de: Erweitere Liste von Zweigen

source: Auto selecting head revision
de: Selektiere Kopfrevision automatisch

source: The `{branch}' branch has multiple heads and <i>Auto select head revision</i> is switched on. Please either select the revision by its id using the combobox below or use the <i>Advanced Find</i> feature.
de: Der Zweig `{branch}' hat mehrere Köpfe und <i>Selektiere Kopfrevision automatisch</i> ist aktiviert. Bitte wählen Sie die Revision über ihre ID in der Auswahlliste unten oder nutzen Sie die <i>Erweiterte Suche</i>-Funktion.

source: Fetching revision list
de: Hole Revisionsliste

source: Populating revision list
de: Erweitere Revisionsliste

source: Fetching manifest
de: Hole Manifest

source: The `{tag_name}' tag is not unique on this branch. Please either select the revision by its id using the combobox below or use the <i>Advanced Find</i> feature.
de: Die Marke `{tag_name}' ist auf diesem Zweig nicht einzigartig. Bitte wählen Sie entweder die Revision über ihre ID in der Auswahlliste unten oder nutzen Sie die <i>Erweiterte Suche</i>-Funktion.

source: Populating file details
de: Erweitere Dateidetails

source: Unknown Contents
de: Unbekannter Inhalt

source: Your version of Monotone does not support suspend certificates. I will adjusted your preferences accordingly.
de: Ihre Version von Monotone unterstützt keine `suspend'-Zertifikate. Das Programm passt Ihre Einstellungen entsprechend an.

source: The Monotone database is currently locked, please dismiss this dialog when this is no longer the case.
de: Die Monotone-Datenbank ist derzeit gesperrt, bitte schließen Sie diesen Dialog, wenn dies nicht mehr der Fall ist.

source: Problem with Monotone request, got: <b><i>{error_message}</i></b> This should not be happening!
de: Problem mit Monotone-Anfrage, bekam: <b><i>{error_message}</i></b> Das sollte nicht passieren!

source: The Monotone subprocess unexpectedly exited with: <b><i>{error_message}</i></b> This is fatal, I am going to exit.
de: Der Monotone Unterprozess endete unerwartet mit: <b><i>{error_message}</i></b> Dies ist ein fataler Fehler, das Programm beendet sich.

source: terminated by signal {number}
de: terminiert durch Signal {number}

source: exited with status {number}
de: beendet mit Status {number}

source: The Monotone subprocess just unexpectedly exited ({error_message}). This should not be happening! It will be restarted when needed.
de: Der Monotone Unterprozess endete gerade unerwartet ({error_message}). Das sollte nicht passieren! Der Prozess wird bei Gebrauch neu gestartet.

source: waitpid failed: {error_message}
de: `waitpid' schlug fehl: {error_message}

source: pipe failed: {error_message}
de: `pipe' schlug fehl: {error_message}

source: <Author>
de: <Autor>

source: Branch
de: Zweig

source: <Branch>
de: <Zweig>

source: Cert
de: Zertifikat

source: <Cert Expression>
de: <Zertifikatsausdruck>

source: Date (=)
de: Datum (=)

source: Date (<=)
de: Datum (<=)

source: Date (>)
de: Datum (>)

source: Head Revision
de: Kopfrevision

source: Identifier
de: Revisions-ID

source: <Revision Id>
de: <Revisions-ID>

source: Key
de: Schlüssel

source: <Signing Key>
de: <unterzeichnender Schlüssel>

source: Logical And
de: Logisches UND

source: Logical Or
de: Logisches ODER

source: Message
de: Logeintrag

source: <Message Text>
de: <Logeintrag>

source: Parent
de: Elternrevision

source: Tag
de: Marke

source: <Tag Name>
de: <Name der Marke>

source: <Selector>
de: <Selektor>

source: <Selector 1>;<Selector 2>
de: <Selektor 1>;<Selektor 2>

source: Date
de: Datum

source: Revision Id
de: Revisions-ID

source: Finding revisions
de: Finde Revisionen

source: There is a problem with your query, Monotone gave: <b><i>{error_message}</i></b>
de: Es gab ein Problem mit Ihrer Anfrage, Monotone gab zurück: <b><i>{error_message}</i></b>

source: No revisions matched your query.
de: Keine Revisionen passten auf Ihre Anfrage.

source: Populating revision details
de: Erweitere Details der Revision

source: Found 1 revision
de: 1 Revision gefunden

source: Nothing found
de: Nichts gefunden

source: Annotated Listing Of {file}
de: Kommentierte Liste von {file}

source: Annotating file
de: Kommentiere Datei

source: Formatting and displaying annotated file
de: Formatiere kommentierte Datei für die Anzeige

source: Display Change _Log
de: Ä_nderungshistorie anzeigen

source: Displaying change log
de: Zeige Änderungshistorie

source: Display File _History
de: _Dateihistorie anzeigen

source: Displaying file history
de: Zeige Dateihistorie

source: Display _Revision History
de: _Revisions-Historie anzeigen

source: Displaying revision history
de: Zeige Revisions-Historie

source: Compare File With Previous _Version
de: Vergleiche Datei mit vorheriger _Version

source: Doing file comparison
de: Führe Dateivergleich aus

source: Compare Revision _With Parent
de: Vergleiche Revision _mit Elternteil

source: Doing revision comparison
de: Führe Revisionsvergleich aus

source: Cannot access unique revision id.
de: Kann einzigartige Revision nicht abrufen

source: The selected revision has more than one parent. I will display the file's history so you can select the specific parent revision.
de: Die ausgewählte Revision hat mehr als eine Elternteil. Das Programm zeigt die Dateihistorie an, damit Sie die gewünschte Elternrevision auswählen können.

source: The selected revision has no parents.
de: Die ausgewählte Revision hat keine Eltern.

source: The current version of the file probably resulted from a merge as it is directly descended from multiple versions. I will display the file's history so you can select the specific parent revision.
de: Die derzeitige Version der Datei wurde wahrscheinlich durch eine Vereinigung erzeugt, da sie direkt von mehreren Revisionen abstammt. Das Programm zeigt die Historie der Datei, sodass Sie die spezifische Elternrevision auswählen können.

source: The selected file version has no ancestors.
de: Die ausgewählte Dateiversion hat keine Nachkommen.

source: The selected revision has more than one parent. I will display the revision's history so you can select the specific parent revision.
de: Die ausgewählte Revision hat mehr als ein Elternteil. Das Programm zeigt die Historie der Revision, sodass Sie die spezifische Elternrevision auswählen können.

source: Problem running mtn annotate, got: <b><i>{error_message}</i></b> This should not be happening!
de: Problem beim Ausführen von `mtn annotate', bekam: <b><i>{error_message}</i></b> Das sollte nicht passieren!

source: Added
de: Hinzugefügt

source: Removed
de: Entfernt

source: Changed
de: Verändert

source: Renamed
de: Umbenannt

source: Attributes
de: Attribute

source: Change Log For {rev}
de: Änderungshistorie für {rev}

source: Revision id:
de: Revisions-ID:

source: Change Log{optional_count}:
de: Logeintrag{optional_count}:

source: Changes Made:
de: Durchgeführte Änderungen:

source: {name}: {attribute} was cleared
de: {name}: {attribute} wurde gelöscht

source: Parent revision id(s):
de: Elternrevision-ID(s):

source: branch
de: Zweig

source: directory
de: Verzeichnis

source: Invalid {name} name `{value}'
de: Ungültiger Name `{value}' für {name}

source: Populating {name} list
de: Erweitere Liste `{name}'

source: open3 failed: {error_message}
de: 'open3' schlug fehl: {error_message}

source: The {name} subprocess could not start, the system gave: <b><i>{error_message}</b></i>
de: Der Unterprozess `{name}' konnte nicht gestartet werden, das System gab zurück: <b><i>{error_message}</b></i>

source: The {name} subprocess failed with an exit status of {exit_code} and printed the following on stderr: <b><i>{error_message}</i></b>
de: Der Unterprozess `{name}' schlug mit dem Rückgabewert {exit_code} fehl und gab folgende Fehlermeldung aus: <b><i>{error_message}</i></b>

source: The {name} subprocess was terminated by signal {number}.
de: Der Unterprozess `{name}' wurde durch das Signal {number} beendet.

source: waitpid failed with: <b><i>{error_message}</i></b>
de: `waitpid' schlug fehl mit: <b><i>{error_message}</i></b>

source: Open Database
de: Datenbank öffnen

source: There is a problem opening the database, the details are: <b><i>{error_message}</i></b>
de: Es gab ein Problem beim Öffnen der Datenbank, die Einzelheiten sind: <b><i>{error_message}</i></b>

source: Save As
de: Speichern unter

source: File already exists. Do you want to replace it?
de: Datei existiert bereits. Möchten Sie sie ersetzen?

source: Confirm
de: Bestätigen

source: Select As Search Column
de: Wählen Sie eine Suchspalte aus

source: The program `{program_name}' cannot be found. Is it installed?
de: Das Programm `{program_name}' kann nicht gefunden werden. Ist es installiert?

source: The requested help section cannot be found or is not known.
de: Der angeforderte Hilfeabschnitt kann nicht gefunden werden oder ist unbekannt.

source: Find Files Within Revision {rev}
de: Finde Dateien in der Revision {rev}

source: Finding matching files
de: Finde passende Dateien

source: Found 1 file
de: 1 Datei gefunden

source: No files matched your query.
de: Keine Datei passte auf Ihre Anfrage.

source: `{pattern}' is an invalid file name pattern.
de: `{pattern}' ist ein ungültiges Dateinamenmuster.

source: `{pattern}' is an invalid content search pattern.
de: `{pattern}' ist ein ungültiges Inhaltssuchmuster.

source: The `between' dates are either the same or the wrong way round.
de: Die Datenangaben für die Zeitspannenfilterung sind entweder gleich oder in der falschen Reihenfolge.

source: A duration of {months} months is too long.
de: Eine Zeitspanne von {months} Monaten ist zu lang.

source: A duration of {years} years is too long.
de: Eine Zeitspanne von {years} Jahren ist zu lang.

source: Could not find `{search_term}'.
de: Konnte `{search_term}' nicht finden.

source: Browse File
de: Datei anzeigen

source: Browse the file in a new browser window
de: Zeige Datei in einem neuen Programmfenster an.

source: Browse Revision
de: Revision anzeigen

source: Browse the revision in a new browser window
de: Zeige die Revision in einem neuen Programmfenster an.

source: Full Change Log
de: Kompletter Logeintrag

source: View the revision's full change log
de: Zeige die komplette Änderungshistorie der Revision

source: Select As Id 1
de: Als erste ID auswählen

source: Select As Id 2
de: Als zweite ID auswählen

source: Select this file revision for comparison as the first file
de: Wähle diese Revision der Datei als erste Dateiversion für den Vergleich

source: Select this file revision for comparison as the second file
de: Wähle diese Revision der Datei als zweite Dateiversion für den Vergleich

source: Select this revision for comparison as the second revision
de: Wähle diese Revision als zweite Revision für den Vergleich

source: Select this revision for comparison as the first revision
de: Wähle diese Revision als erste Revision für den Vergleich

source: Revision History For {rev}
de: Revisions-Historie für {rev}

source: <b>Revision History</b>
de: <b>Revisions-Historie</b>

source: Sorting revision list
de: Sortiere Revisionsliste

source: File History For {file}
de: Datei-Historie für {file}

source: <b>File History</b>
de: <b>Datei-Historie</b>

source: Differences Between Revisions {rev_1} and {rev_2}
de: Unterschiede zwischen den Revisionen {rev_1} und {rev_2}

source: <b>File Comparison</b>
de: <b>Dateivergleich</b>

source: <b>Revision Comparison</b>
de: <b>Revisionsvergleich</b>

source: Calculating differences
de: Berechne die Unterschiede

source: Formatting and displaying differences
de: Formatiere die Unterschiede für die Anzeige

source: Displaying differences
de: Zeige Unterschiede an

source: Populating file list
de: Erweitere Dateiliste

source: Summary
de: Zusammenfassung

source: The name of the selected file has changed between the two selected revisions and cannot be compared internally. Would you like to do the comparison using the external helper application?
de: Der Name der ausgewählten Datei hat sich zwischen den beiden Revisionen verändert und die Datei kann daher nicht intern verglichen werden. Möchten Sie die externe Hilfsanwendung zum Vergleich nutzen?

source: External Comparison
de: Externer Vergleich

source: The file contents cannot be found in the selected revisions. This should not be happening.
de: Die Dateiinhalte konnten nicht in den ausgewählten Revisionen gefunden werden. Das sollte nicht passieren.

source: All Branches
de: Alle Zweige

source: Revision Change Log
de: Revisions-Logeintrag

source: - Revision Change Log
de: - Revisions-Logeintrag

source: + Revision Change Log
de: + Revisions-Logeintrag

source: Cannot call the external helper application to do the comparison as one has not been specified in the user's preferences.
de: Kann externe Hilfsanwendung für den Vergleich nicht aufrufen, da noch keine Anwendung in den Benutzereinstellungen festgelegt wurde.

source: OLDER_
de: NEUER_

source: NEWER_
de: ÄLTER_

source: Problem running mtn diff, got: <b><i>{error_message}</i></b> This should not be happening!
de: Problem beim Ausführen von `mtn diff', bekam: <b><i>{error_message}</i></b> Das sollte nicht passieren!

source: `{server}' is an invalid server name (<server>[:port] is expected).
de: `{server}' ist ein ungültiger Servername (<server>[:port] erwartet).

source: `{server}' is already entered into your bookmarks list.
de: `{server}' befindet sich bereits in Ihrer Lesezeichenliste.

source: The preferences dialog cannot be displayed:
de: Der Einstellungsdialog kann nicht angezeigt werden:

source: Invalid user preferences file: {error_message}
de: Ungültige Benutzereinstellungs-Datei: {error_message}

source: Preferences file, `{file_name}',
de: Die Einstellungsdatei `{file_name}'

source: is corrupt, please remove it.
de: ist beschädigt, bitte entfernen Sie sie.

source: # DO NOT EDIT! This is an automatically generated file.
de: # NICHT BEARBITEN! Dies ist eine automatisch generierte Datei.

source: # Changes to this file may be lost or cause
de: # Änderungen in dieser Datei können verloren gehen

source: mtn-browse to malfunction.
de: oder zu Fehlern in mtn-browse führen.

source: `{mime_type}' does not look like a valid MIME type.
de: `{mime_type}' sieht nicht wie ein gültiger MIME-Typ aus.

source: `{mime_type}' is already listed.
de: `{mime_type}' ist bereits gelistet.

source: `{pattern}' is already used in MIME type `{mime_type}'.
de: `{pattern}' wird bereits für den MIME-Typ `{mime_type}' genutzt.

source: MIME Type
de: MIME-Typ

source: File Name Patterns
de: Dateiname-Muster

source: Helper Application
de: Hilfsanwendung

source: The external file comparison application field is invalid, please correct before attempting to resave.
de: Das Feld für die externe Hilfsanwendung zum Vergleich ist ungültig; bitte berichtigen Sie dies vor einem erneuten Speicherversuch.

source: Cannot load system MIME types.
de: Kann System-MIME-Typen nicht laden.

source: _New
de: _Neu

source: New _Blank
de: Neues _leeres Fenster

source: Connect To _Server
de: Mit _Server verbinden

source: _Quit
de: _Beenden

source: File Encoding
de: Dateikodierung

source: _Tools
de: _Werkzeuge

source: Choose _Authentication Key
de: Wähle _Authentifizierungsschlüssel

source: _Compare Arbitrary Revisions
de: _Vergleiche beliebige Revisionen

source: _Help Contents
de: _Hilfeinhalte

source: Help On _Window
de: Hilfe für dieses _Fenster

source: _Context Help
de: _Kontextsensitive Hilfe

source: New browser window
de: Neues Browserfenster

source: Open a database
de: Eine Datenbank öffnen

source: Close the current database
de: Aktuelle Datenbank schließen

source: Reload the current database
de: Aktuelle Datenbank neu laden

source: Reload
de: Neu laden

source: User preferences
de: Benutzereinstellungen

source: Display help contents page
de: Zeigt die Seite mit Hilfeinhalten an

source: Project branch to access
de: Zugriff auf Projektzweig

source: Branch:
de: Zweig:

source: Revision within project to access
de: Zugriff auf Revision innerhalb des Projekts

source: Select this if only those revisions that have been tagged on the current branch are to be listed
de: Wählen Sie dies, wenn nur solche Revisionen gelistet werden sollen, die auf dem derzeitigen Zweig markiert wurden

source: Tagged
de: Markiert

source: Use more advanced selection criteria for choosing a revision
de: Benutze erweiterte Auswahlkriterien für die Auswahl einer Revision

source: View revision history in Monotone-Viz
de: Zeige Revisionshistorie in Monotone-Viz

source: View revision's change history
de: Zeige die Änderungshistorie der Revision

source: View revision's change log
de: Zeige den Logeintrag der Revision

source: <b>View</b>
de: <b>Anzeige</b>

source: Directory to be viewed
de: Verzeichnis, welches angezeigt werden soll

source: Directory:
de: Verzeichnis:

source: Go up one directory level
de: Gehe eine Verzeichnisebene nach oben

source: Find files based on one or more search criteria
de: Finde Dateien, die ein oder mehrere Suchkriterien erfüllen

source: <b>Revision Browser</b>
de: <b>Revisions-Browser</b>

source: Name of file being displayed
de: Name der angezeigten Datei

source: File:
de: Datei:

source: Time when the displayed file was last updated with respect to this revision
de: Zeit, zu der die angezeigte Datei in Bezug auf diese Revision zuletzt aktualisiert wurde

source: Last update:
de: Zuletzt geändert:

source: Author of the file revision being displayed
de: Autor der Dateirevision, die angezeigt wird

source: Author:
de: Autor:

source: Revision id in which the displayed file was last updated with respect to this revision
de: Revisions-ID, in der die angezeigte Datei in Bezug zu dieser Revsision zuletzt aktualisiert wurde

source: Revision id:
de: Revisions-ID

source: Toggle the showing of line numbers
de: Schalte die Anzeige der Zeilennummern um

source: Search text
de: Suche Text

source: Save file contents to disk
de: Speichere die Dateiinhalte permanent

source: Load file contents into a viewer
de: Lade die Dateiinhalte in eine Anzeige

source: Annotate file contents
de: Kommentiere die Dateiinhalte

source: View file's change history
de: Zeige die Änderungshistorie der Datei

source: <b>File Viewer</b>
de: <b>Dateianzeige</b>

source: Name of the database being accessed
de: Name der Datenbank, auf die zugegriffen wird

source: Database:
de: Datenbank:

source: Author of the currently selected revision
de: Autor der derzeit ausgewählten Revision

source: Date of the currently selected revision
de: Datum der derzeit ausgewählten Revision

source: Date:
de: Datum:

source: Change log for the currently selected revision
de: Logeintrag für die derzeit ausgewählte Revision

source: Change log:
de: Logeintrag:

source: Advanced Find
de: Erweiterte Suche

source: Select Simple Query you you just want to manually select the branch and revision from drop down lists
de: Wählen Sie 'Einfache Anfrage', wenn Sie lediglich manuell einen Zweig und eine Revision aus einer Liste auswählen möchten.

source: Simple query
de: Einfache Anfrage

source: Select Advanced Query if you want to specify very specific selection critia
de: Wählen Sie `Erweiterte Anfrage', wenn Sie sehr spezifische Auswahlkriterien festlegen möchten

source: Advanced query
de: Erweiterte Anfrage

source: <b>Mode</b>
de: <b>Modus</b>

source: <b>Simply Query</b>
de: <b>Einfache Anfrage</b>

source: Enter an advanced Monotone selection query - you can use the helper tools directly below this entry field if you cannot remember the syntax
de: Geben Sie eine erweiterte Monotone-Auswahlanfrage an - Sie können die Hilfsmittel unterhalb des Eingabefeldes benutzen, wenn Sie sich nicht an die Syntax erinnern können.

source: Search term:
de: Suchbegriff:

source: Execute the query
de: Anfrage ausführen

source: Stop the query
de: Anfrage stoppen

source: Enter the current selector into the query above
de: Fügt den derzeigen Selektor in die obige Abfrage ein

source: The type of selector that is to be inserted above
de: Der Typ des Selektors, der oben eingefügt wird

source: Author Branch Cert Date (=) Date (<=) Date (>) Head Revision Identifier Key Logical And Logical Or Message Parent Tag ancestors() children() descendants() difference() lca() max() parents() pick()
de: Autor Zweig Zertifikat Datum (=) Datum (<=) Datum (>) Kopfrevision Revisions-ID Schlüssel Logisches UND Logisches ODER Logmeldung Elternteil Marke ancestors() children() descendants() difference() lca() max() parents() pick()

source: Enter any arguments here
de: Geben Sie hier etwaige Argumente ein

source: Use this to specify the date for date based selectors
de: Nutzen Sie dies, um das Datum für datumsbasierte Selektoren zu spezifizieren

source: <b>Advanced Query</b>
de: <b>Erweiterte Abfrage</b>

source: <b>Revisions</b>
de: <b>Revision</b>

source: <b>Change Log</b>
de: <b>Logeintrag</b>

source: Number of revisions listed
de: Anzahl der aufgelisteten Revisionen

source: Number of revisions:
de: Anzahl der Revisionen:

source: Restrict the above history to the selected branch
de: Beschränkt die obige Historie auf den ausgewählten Zweig
