Repository: coosoft/mtn-browse
Catalog: locale/*.po
Languages: de

source: Restrict to:
de: Beschränke auf:

source: Stop gathering history details
de: Stoppe die Abfrage der Historie

source: The first of two revision ids selected for comparison
de: Die erste von zwei ausgewählten Revision-IDs zum Vergleich

source: First revision id:
de: Erste Revisions-ID:

source: The second of two revision ids selected for comparison
de: Die zweite von zwei ausgewählten Revision-IDs zum Vergleich

source: Second revision id:
de: Zweite Revisions-ID:

source: Compare the two selected revisions or files
de: Vergleiche die beiden ausgewählten Revisionen oder Dateien

source: <b>Compare</b>
de: <b>Vergleichen</b>

source: Jump to the selected file
de: Zur ausgewählten Datei springen

source: Jump to file:
de: Zu Datei springen:

source: Display the differences for the currently selected file in an external viewer
de: Zeige die Unterschiede für die derzeit ausgewählte Datei in einem externen Anzeigeprogramm

source: Save the differences to disk
de: Speichere Änderungen permanent

source: Stop the comparison
de: Beende den Vergleich

source: View the change log of the older revision
de: Zeige die Änderungshistorie der älteren Revisionen

source: View the change log of the younger revision
de: Zeige die Änderungshistorie der jüngeren Revisionen

source: <b>Annotation</b>
de: <b>Kommentierung</b>

source: Find Text
de: Text finden

source: Enter the text that is to be searched for
de: Geben Sie den Text ein nach dem gesucht werden soll

source: Search for:
de: Suche nach:

source: Choose whether searches are to be case sensitive or not
de: Wählen Sie aus, ob Suchanfragen die Groß-/Kleinschreibung beachten sollen oder nicht

source: Case sensitive
de: Groß-/Kleinschreibung beachten

source: Select the direction of the search
de: Wählen Sie die Suchrichtung aus

source: Search backwards
de: Rückwärts suchen

source: Use regular expression search patterns
de: Nutze reguläre Ausdrücke als Suchmuster

source: Regular expression
de: Regulärer Ausdruck

source: Preferences
de: Einstellungen

source: Look for a Monotone database to open
de: Suche nach einer Monotone- Datenbank zum Öffnen

source: Browse ...
de: Auswählen ...

source: Name of the Monotone database to open automatically on startup
de: Name der Monotone-Datenbank, die automatisch bei Programmstart geöffnet wird

source: Database to open:
de: Zu öffnende Datenbank:

source: Actions to take when starting up inside a Monotone workspace
de: Aktionen, die bei einem Start in einem Monotone-Arbeitsverzeichnis ausgeführt werden sollen

source: Workspace:
de: Arbeitsverzeichnis:

source: Select this if the workspace's database is to be opened instead of the named database above upon startup
de: Wählen Sie aus, ob die Datenbank des Arbeitsbereichs anstatt der oben benannten Datenbank bei Programmstart geöffnet werden soll.

source: Takes precedence
de: Hat Vorrang

source: Select this if the workspace's branch and revision are to be automatically loaded into the browser upon startup
de: Wählen Sie aus, ob der Zweig des Arbeitsbereichs und die Revision automatisch bei Programmstart in den Browser geladen werden sollen.

source: Auto select branch and revision
de: Selektiere Zweig und Revision automatisch

source: <b>Startup Defaults</b>
de: <b>Standardeinstellungen bei Programmstart</b>

source: Select if the head revision on a branch should automatically be loaded into a browser as soon as the branch has been selected (this only works when selecting revisions by their ids and not by their tags)
de: Wählen Sie aus, ob die Kopfrevision eines Zweigs automatisch in ein Programmfenster geladen werden soll, wenn ein Zweig ausgewählt wurde. (Dies funktioniert nur, wenn Revision über ihre IDs und nicht über ihre Marken ausgewählt werden.)

source: Auto select head revision
de: Selektiere die Kopfrevision automatisch

source: <b>Revision Selection</b>
de: <b>Auswahl von Revisionen</b>

source: Settings for controlling the listing of tagged revisions in ComboBox menus
de: Einstellungen, die die Listen von markierten Revisionen in Auswahllisten kontrollieren

source: Tagged lists:
de: Markierte Listen:

source: The maximum number of tags to be displayed (starting from the most recent, 0 = unlimited)
de: Die maximale Anzahl von Marken die angezeigt werden sollen (beginnend mit der neuesten, 0 = nicht beschränkt)

source: Limit to:
de: Beschränken auf:

source: The maximum number of ids to be displayed (starting from the most recent, 0 = unlimited)
de: Die maximale Anzahl von IDs die angezeigt werden sollen (beginnend mit der neuesten, 0 = nicht beschränkt)

source: Settings for controlling the listing of revision ids in ComboBox menus
de: Einstellungen, die die Listen von Revisionen in Auswahllisten kontrollieren

source: Id lists:
de: ID-Listen:

source: Select Sort chronologically if you want the ids to be order on date, starting with the newest
de: Wählen Sie `Chronologisch sortieren', wenn Sie möchten, dass die IDs dem Datum nach sortiert werden sollen, beginnend mit der neuesten Revision.

source: Sort chronologically
de: Chronologisch sortieren

source: Select Sort by id if you want the tags to be order aphabetically
de: Wählen Sie `Nach ID sortieren', wenn Sie die Marken alphabetisch sortiert haben möchten

source: Sort by id
de: Nach ID sortieren

source: Select Sort chronologically if you want the tags to be order on date, starting with the newest
de: Wählen Sie `Chronologisch sortieren', wenn Sie möchten, dass die Marken dem Datum nach sortiert werden sollen, beginnend mit der neuesten Marke.

source: Select Sort by name if you want the tags to be order aphabetically
de: Wählen Sie `Nach Name sortieren', wenn Sie möchten, dass die Marken alphabetisch sortiert werden

source: Sort by name
de: Nach Name sortieren

source: The maximum number of items to store in histories
de: Die maximale Anzahl von Einträgen, die in Historien gespeichert werden sollen

source: Setting for controlling the amount of history stored in ComboBox menus
de: Einstellung kontrolliert die Größe der Historie, welche in Auswahlmenüs gespeichert wird

source: History size:
de: Größe der Historie:

source: Select this if you do not want the branch, revision and directory ComboBox entry lists to update as you type in values (can help with speed when dealing with large lists)
de: Wählen Sie diese Option, wenn Sie nicht möchten, dass Zweig-, Revisions- und Verzeichnislisten sich automatisch bei der Eingabe von Werten aktualisieren. (Kann für die Geschwindigkeit bei großen Listen förderlich sein.)

source: Static lists
de: Statische Listen

source: Select this if you want feedback in the form of special tooltips when typing in values into ComboBox entry fields
de: Wählen Sie dies aus, wenn Sie Feedback bei der Eingabe von Werten in Auswahlfeldern in Form von speziellen Kurzinfos bekommen möchten.

source: Show tooltips
de: Zeige Kurzinfos

source: Settings for controlling the behaviour of auto-completion in ComboBox entry fields
de: Einstellung kontrolliert das Verhalten der Autovervollständigung in Auswahlmenüs

source: Auto-completion:
de: Auto-Vervollständigung:

source: <b>ComboBox Settings</b>
de: <b>Auswahllisten-Einstellungen</b>

source: Select this if you want suspended revisions and their related branches to be displayed
de: Wählen Sie `Zeige gesperrte Revisionen', wenn Sie gesperrte (`suspended') Revisionen und deren zugehörige Zweige anzeigen möchten.

source: Show suspended revisions
de: Zeige gesperrte Revisionen

source: Select this if you want a file's latest modification time and author to be displayed alongside the file name Please note that selecting this option may have a severe performance penalty depending upon the version of Monotone that you are using
de: Wählen Sie diese Option, wenn Sie das Datum der letzten Bearbeitung und den Autor neben dem Dateinamen angezeigt bekommen möchten. Bitte beachten Sie, dass die Auswahl dieser Option u.U. zu erheblichen Performanceeinbußen abhängig von der verwendeten Monotone-Version führen kann.

source: Detailed file listings
de: Detaillierte Dateilisten

source: Select this if you want all folders to be listed before any files
de: Wählen diese Option, wenn Sie möchten, dass alle Verzeichnise vor etwaigen Dateien aufgelistet werden.

source: Folders come first
de: Verzeichnisse kommen zuerst

source: Select this if you want line numbers to be shown in file listings by default
de: Wählen diese Option, wenn Sie möchten, dass Zeilennummern in Listen standardmäßig gezeigt werden.

source: Show line numbers
de: Zeige Zeilennummern

source: The binary threshold, above which a file's contents are considered to be binary in nature
de: Der binäre Schwellenwert, über welchen die Inhalte einer Datei als binär betrachtet werden

source: Binary threshold:
de: Binärer Schwellenwert:

source: <b>Browser Display Options</b>
de: <b>Anzeigeoptionen des Browsers</b>

source: Select this if the search terms used when searching lists (invoked by typing Ctrl-F) are to be treated as regular expressions instead of plain text
de: Wählen Sie diese Option, wenn Suchworte beim Durchsuchen von Listen (ausgeführt durch Strg-F) als reguläre Ausdrücke und nicht als normaler Text behandelt werden sollen.

source: Search as regular expression
de: Suche als regulärer Ausdruck

source: <b>List Options</b>
de: <b>Listenoptionen</b>

source: Enter a command for displaying the differences between two text files 1) If this field is blank then the external file comparison button on a revision/file comparison window will be disabled 2) The command to run the application must take the two mandatory tokens {file1} and {file2}, these are replaced with the files' full path names 3) The file referred to by the token {file1} will be an older version than that referred to by {file2}
de: Geben Sie ein Kommando ein, um die Unterschiede zwischen zwei Textdateien anzuzeigen 1) Wenn dieses Feld leer ist, wird der Knopf zum externen Dateivergleich deaktiviert. 2) Das Kommando zum Starten der Hilfsanwendung muss die zwei Pflichtargumente {file1} und {file2} erhalten, die zur Laufzeit durch die vollen Pfadnamen der Dateien ersetzt werden. 3) Die Datei, die durch den Platzhalter {file1} referenziert wird, wird älter sein als die Datei, die durch {file2} referenziert wird.

source: Application:
de: Anwendung:

source: <b>External File Comparison Application</b>
de: <b>Anwendung zum externen Dateivergleich</b>

source: <b>General</b>
de: <b>Allgemein</b>

source: Select the font used for displaying file contents and reports (for best results make sure it is mono-spaced)
de: Wählen Sie die Schriftart, die für die Anzeige von Dateiinhalten und Reportings benutzt wird. (Für bessere Ergebnisse wählen Sie am besten eine Schriftart mit fester Schriftweite.)

source: File content/report font:
de: Dateiinhalt- / Reportschriftart

source: Pick A Font
de: Eine Schrift auswählen

source: <b>Fonts</b>
de: <b>Schriften</b>

source: Select if the toolbar buttons are to hide their text labels
de: Wählen Sie diese Option, wenn Schaltflächen auf Werkzeugleisten ohne ihre Textbeschreibung angezeigt werden sollen.

source: Hide text
de: Text verberge

source: Select if the toolbars are to be fixed rather than movable
de: Wählen Sie diese Option, wenn die Werkzeuglisten fixiert und nicht verschiebbar sein sollen.

source: Fixed
de: Fixiert

source: <b>Toolbar Settings</b>
de: <b>Werkzeugleisten-Einstellungen</b>

source: Select if comparisons between files and revisions are to be highlighted in colour instead of plain black text
de: Wählen Sie aus, ob Vergleiche zwischen Dateien und Revisionen mit Farben anstatt einfachen schwarzen Text hervorgehoben werden sollen.

source: Coloured comparison listings
de: Farbige Vergleichsdarstellung

source: <b>File/Revision Comparison</b>
de: <b>Datei-/Revisionsvergleich</b>

source: The first set of line prefix colours used in annotated listings
de: Die erste Menge von Farben für Linienpräfixe in kommentierten Listen

source: Annotation prefix 1:
de: Kommentierungs-Präfix 1:

source: Colour of the first revision in comparison listings
de: Farbe der ersten Revision in Vergleichslisten

source: Colour of the second revision in comparison listings
de: Farbe der zweiten Revision in Vergleichslisten

source: Text foreground colour
de: Textvordergrundfarbe

source: Foreground:
de: Vordergrund:

source: Text background colour
de: Texthintergrundfarbe

source: Background:
de: Hintergrund:

source: Pick A Colour
de: Wählen Sie eine Farbe aus

source: Text foreground colour used in context lines
de: Textvordergrundfarbe in Kontextzeilen benutzt

source: Highlight:
de: Hervorhebung:

source: The first set of line text colours used in annotated listings
de: Die erste Menge von Linientextfarben, die in Kommentierungslisten genutzt wird

source: Annotation text 1:
de: Kommentierungs-Text 1:

source: The second set of line prefix colours used in annotated listings
de: Die zweite Menge von Linienpräfixfarben, die in kommentierungslisten genutzt wird

source: Annotation prefix 2:
de: Kommentierungs-Präfix 2:

source: The second set of line text colours used in annotated listings
de: Die zweite Menge von Linientextfarben, die in Kommentierungslisten genutzt wird

source: Annotation text 2:
de: Kommentierungs-Text 2:

source: <b>Colours</b>
de: <b>Farben</b>

source: <b>Appearance</b>
de: <b>Aussehen</b>

source: Add a new MIME type to the list
de: Füge einen neuen MIME-Typ zur Liste hinzu

source: Remove the currently selected MIME type from the list
de: Entferne den derzeit ausgewählten MIME-Typ von der Liste

source: <b>MIME Types</b>
de: <b>MIME-Typen</b>

source: Add a new file name pattern to the list
de: Füge ein neues Dateinamen-Muster zur Liste hinzu

source: Remove the currently selected file name pattern from the list
de: Entferne das derzeit ausgewählte Dateinamen-Muster von der Liste

source: <b>File Name Patterns</b>
de: <b>Dateinamen-Muster</b>

source: Select this if files of the selected type are to be displayed in the browser's internal viewer
de: Wählen Sie dies, wenn Dateien vom ausgewählten Typ im internen Anzeigefenster dargestellt werden sollen

source: Display internally
de: Zeige intern an

source: Select this if syntax highlighting is to be attempted for files of the selected type
de: Wählen Sie dies, wenn versucht werden soll, die Syntax der Dateien vom ausgewählten Typ hervorzuheben

source: Syntax highlight
de: Syntaxhervorhebung

source: Enter a command for loading files of the selected type into an appropiate viewer or editor 1) If this field is blank then the default application associated with this file type is used 2) The optional token {file} is replaced with the file's full path name, if this token is not present then the file name is simply appended onto the end of the command
de: Geben Sie ein Kommando zum Laden von Dateien des ausgewählten Typs in ein Anzeigeprogramm bzw. Editor an 1) Wenn das Feld leer ist, wird die Standardanwendung, die mit diesen Dateityp verbunden ist, genutzt. 2) Der optionale Platzhalter {file} wird durch den kompletten Pfad der Datei ersetzt; wenn der Platzhalter nicht angegeben wird, wird der Dateiname einfach ans Ende des Kommandos angehängt.

source: Helper application:
de: Hilfsanwendung:

source: <b>File Actions</b>
de: <b>Dateiaktionen</b>

source: Enter the file name pattern that is to be searched for
de: Geben Sie ein Dateinamen-Muster ein, nach dem gesucht werden soll

source: Files named:
de: Dateiname:

source: The place in the directory hierarchy where the search will start from
de: Der Startpunkt der Verzeichnishierarchie, von der die Suche aus starten soll

source: Searching from:
de: Suchstartpunkt:

source: Choose whether to search subdirectories or not
de: Wählen Sie aus, ob Unterverzeichnisse durchsucht werden sollen oder nicht

source: Search subdirectories
de: Durchsuche Unterverzeichnisse

source: Enter the text that is to be searched for inside files
de: Geben Sie den Text ein, nach dem innerhalb der Dateien gesucht werden soll

source: Files containing:
de: Dateien, die folgendes beinhalten:

source: Search binary files as well as text files
de: Durchsuche Binärdateien und Textdateien gleichermaßen

source: Search binary files
de: Durchsuche Binärdateien

source: <b>Contents</b>
de: <b>Inhalte</b>

source: Select this mode if you want to search for files that were last modified between the two specified dates
de: Wählen Sie diesen Modus, wenn Sie nach Dateien suchen möchten, die zwischen den beiden angegebenen Daten verändert wurden

source: between
de: zwischen

source: Select files based upon their last modification date and time
de: Wählen Sie Dateien basierend auf ihrem letzten Veränderungsdatum und -zeitpunkt aus

source: Find all files created or modified:
de: Finde alle Dateien erzeugt oder geändert:

source: Select this mode if you want to select files last modified within the last n hours/days/months...
de: Wählen Sie diesen Modus, wenn sie Dateien einbeziehen möchten, die innerhalb der letzten n Stunden/Tage/Monate verändert wurden.

source: during the previous
de: während der vergangenen

source: and
de: und

source: Select files based upon their size
de: Wählen Sie Dateien basierend auf ihrer Größe aus

source: File size is:
de: Dateigröße ist:

source: Select files last modified by the specified user
de: Wählen Sie Dateien aus, die von einem bestimmten Nutzer zuletzt verändert wurden

source: Files last modified by:
de: Dateien zuletzt geändert von:

source: Enter the duration here
de: Geben Sie hier die Zeitspanne ein

source: Enter the file size here
de: Geben Sie hier die Dateigröße ein

source: Use this to specify the oldest modification date for your search
de: Nutzen Sie dies, um das älteste Bearbeitungsdatum für Ihre Suche festzulegen

source: Use this to specify the youngest modification date for your search
de: Nutzen Sie dies, um das jüngste Bearbeitungsdatum für Ihre Suche festzulegen

source: The unit of time to be used
de: Die zu nutzende Zeiteinheit

source: Minute(s) Hour(s) Day(s) Month(s) Year(s)
de: Minute(n) Stunde(n) Tag(e) Monat(e) Jahr(e)

source: The type of comparison to be performed
de: Der Typ des Vergleichs der ausgeführt werden soll

source: Any Size At Least At Most Equal To
de: Jede Größe Mindestens Höchstens Genau

source: The unit of file size to be used
de: Die Einheit, die bei der Größensuche benutzt werden soll

source: <b>Properties</b>
de: <b>Eigenschaften</b>

source: Stop finding files
de: Breche Dateifinden ab

source: Find the files
de: Finde die Dateien

source: <b>Query</b>
de: <b>Anfrage</b>

source: Name of the file being displayed
de: Name der angezeigten Datei

source: Date of when file was last changed
de: Datum, wann die Datei zuletzt geändert wurde

source: Author of the selected file
de: Autor der ausgewählten Datei

source: Time when the selected file was last updated with respect to this revision
de: Zeitpunkt, zu der die ausgewählte Datei in Bezug auf diese Revision zuletzt aktualisiert wurde

source: File's unique id in database
de: Einzigartige ID der Datei in der Datenbank

source: Id of revision when file was last changed
de: ID der Revision, in der die Datei zuletzt geändert wurde

source: Id of the selected file
de: ID der ausgewählten Datei

source: File id:
de: Datei-ID

source: Revision id in which the selected file was last updated with respect to this revision
de: Revisions-ID, in der die ausgewählte Datei in Bezug auf diese Revision zuletzt aktualisiert wurde

source: <b>Results</b>
de: <b>Ergebnisse</b>

source: Multiple Revisions
de: Mehrere Revisionen

source: Select the revision that you want
de: Wählen Sie die gewünschte Revision aus

source: Revisions:
de: Revisionen:

source: Add a new Monotone server to the list
de: Füge einen neuen Monotone- Server zur Liste hinzu

source: Remove the currently selected Monotone server from the list
de: Entferne den derzeit ausgewählten Monotone-Server von der Liste

source: Compare Arbitrary Revisions
de: Vergleiche beliebige Revisionen

source: Choose a revision using advanced selection criteria
de: Wähle eine Revision anhand der erweiterten Abfragekriterien

source: Compare the two chosen revisions
de: Vergleiche die beiden ausgewählten Dateien
